; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	thermograph2 - mode
	image1 - mode
	image0 - mode
	Star3 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation0 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 189)
	(supports instrument3 image0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 176)
	(= (data Phenomenon4 thermograph2) 133)
	(= (data Phenomenon5 thermograph2) 32)
	(= (data Star6 thermograph2) 185)
	(= (data Planet7 thermograph2) 5)
	(= (data Star8 thermograph2) 153)
	(= (data Star9 thermograph2) 196)
	(= (data Planet10 thermograph2) 27)
	(= (data Star11 thermograph2) 44)
	(= (data Phenomenon4 image1) 12)
	(= (data Phenomenon5 image1) 119)
	(= (data Star6 image1) 10)
	(= (data Planet7 image1) 57)
	(= (data Star8 image1) 144)
	(= (data Star9 image1) 119)
	(= (data Planet10 image1) 161)
	(= (data Star11 image1) 70)
	(= (data Phenomenon4 image0) 184)
	(= (data Phenomenon5 image0) 70)
	(= (data Star6 image0) 237)
	(= (data Planet7 image0) 28)
	(= (data Star8 image0) 70)
	(= (data Star9 image0) 45)
	(= (data Planet10 image0) 195)
	(= (data Star11 image0) 152)
	(= (slew_time Star3 GroundStation0) 41.41)
	(= (slew_time GroundStation0 Star3) 41.41)
	(= (slew_time Star3 Star1) 84.56)
	(= (slew_time Star1 Star3) 84.56)
	(= (slew_time Star3 GroundStation2) 2.623)
	(= (slew_time GroundStation2 Star3) 2.623)
	(= (slew_time GroundStation2 GroundStation0) 37.56)
	(= (slew_time GroundStation0 GroundStation2) 37.56)
	(= (slew_time GroundStation2 Star1) 29.05)
	(= (slew_time Star1 GroundStation2) 29.05)
	(= (slew_time Star1 GroundStation0) 32.35)
	(= (slew_time GroundStation0 Star1) 32.35)
	(= (slew_time Phenomenon4 GroundStation0) 27.59)
	(= (slew_time GroundStation0 Phenomenon4) 27.59)
	(= (slew_time Phenomenon4 Star1) 15.74)
	(= (slew_time Star1 Phenomenon4) 15.74)
	(= (slew_time Phenomenon4 GroundStation2) 59.6)
	(= (slew_time GroundStation2 Phenomenon4) 59.6)
	(= (slew_time Phenomenon4 Star3) 79.1)
	(= (slew_time Star3 Phenomenon4) 79.1)
	(= (slew_time Phenomenon5 GroundStation0) 2.788)
	(= (slew_time GroundStation0 Phenomenon5) 2.788)
	(= (slew_time Phenomenon5 Star1) 28.5)
	(= (slew_time Star1 Phenomenon5) 28.5)
	(= (slew_time Phenomenon5 GroundStation2) 10.05)
	(= (slew_time GroundStation2 Phenomenon5) 10.05)
	(= (slew_time Phenomenon5 Star3) 5.914)
	(= (slew_time Star3 Phenomenon5) 5.914)
	(= (slew_time Phenomenon5 Phenomenon4) 37.87)
	(= (slew_time Phenomenon4 Phenomenon5) 37.87)
	(= (slew_time Star6 GroundStation0) 0.9513)
	(= (slew_time GroundStation0 Star6) 0.9513)
	(= (slew_time Star6 Star1) 22.38)
	(= (slew_time Star1 Star6) 22.38)
	(= (slew_time Star6 GroundStation2) 46.75)
	(= (slew_time GroundStation2 Star6) 46.75)
	(= (slew_time Star6 Star3) 10.09)
	(= (slew_time Star3 Star6) 10.09)
	(= (slew_time Star6 Phenomenon4) 52.51)
	(= (slew_time Phenomenon4 Star6) 52.51)
	(= (slew_time Star6 Phenomenon5) 64.1)
	(= (slew_time Phenomenon5 Star6) 64.1)
	(= (slew_time Planet7 GroundStation0) 0.705)
	(= (slew_time GroundStation0 Planet7) 0.705)
	(= (slew_time Planet7 Star1) 9.038)
	(= (slew_time Star1 Planet7) 9.038)
	(= (slew_time Planet7 GroundStation2) 12.3)
	(= (slew_time GroundStation2 Planet7) 12.3)
	(= (slew_time Planet7 Star3) 61)
	(= (slew_time Star3 Planet7) 61)
	(= (slew_time Planet7 Phenomenon4) 9.743)
	(= (slew_time Phenomenon4 Planet7) 9.743)
	(= (slew_time Planet7 Phenomenon5) 42.84)
	(= (slew_time Phenomenon5 Planet7) 42.84)
	(= (slew_time Planet7 Star6) 78.36)
	(= (slew_time Star6 Planet7) 78.36)
	(= (slew_time Star8 GroundStation0) 12.7)
	(= (slew_time GroundStation0 Star8) 12.7)
	(= (slew_time Star8 Star1) 18.78)
	(= (slew_time Star1 Star8) 18.78)
	(= (slew_time Star8 GroundStation2) 28.44)
	(= (slew_time GroundStation2 Star8) 28.44)
	(= (slew_time Star8 Star3) 4.564)
	(= (slew_time Star3 Star8) 4.564)
	(= (slew_time Star8 Phenomenon4) 30.02)
	(= (slew_time Phenomenon4 Star8) 30.02)
	(= (slew_time Star8 Phenomenon5) 96.67)
	(= (slew_time Phenomenon5 Star8) 96.67)
	(= (slew_time Star8 Star6) 4.838)
	(= (slew_time Star6 Star8) 4.838)
	(= (slew_time Star8 Planet7) 9.883)
	(= (slew_time Planet7 Star8) 9.883)
	(= (slew_time Star9 GroundStation0) 22.66)
	(= (slew_time GroundStation0 Star9) 22.66)
	(= (slew_time Star9 Star1) 71.72)
	(= (slew_time Star1 Star9) 71.72)
	(= (slew_time Star9 GroundStation2) 36.29)
	(= (slew_time GroundStation2 Star9) 36.29)
	(= (slew_time Star9 Star3) 43.4)
	(= (slew_time Star3 Star9) 43.4)
	(= (slew_time Star9 Phenomenon4) 31.37)
	(= (slew_time Phenomenon4 Star9) 31.37)
	(= (slew_time Star9 Phenomenon5) 89.03)
	(= (slew_time Phenomenon5 Star9) 89.03)
	(= (slew_time Star9 Star6) 53.19)
	(= (slew_time Star6 Star9) 53.19)
	(= (slew_time Star9 Planet7) 30.81)
	(= (slew_time Planet7 Star9) 30.81)
	(= (slew_time Star9 Star8) 7.187)
	(= (slew_time Star8 Star9) 7.187)
	(= (slew_time Planet10 GroundStation0) 6.754)
	(= (slew_time GroundStation0 Planet10) 6.754)
	(= (slew_time Planet10 Star1) 44.61)
	(= (slew_time Star1 Planet10) 44.61)
	(= (slew_time Planet10 GroundStation2) 25.13)
	(= (slew_time GroundStation2 Planet10) 25.13)
	(= (slew_time Planet10 Star3) 45.87)
	(= (slew_time Star3 Planet10) 45.87)
	(= (slew_time Planet10 Phenomenon4) 31.66)
	(= (slew_time Phenomenon4 Planet10) 31.66)
	(= (slew_time Planet10 Phenomenon5) 21.29)
	(= (slew_time Phenomenon5 Planet10) 21.29)
	(= (slew_time Planet10 Star6) 15.41)
	(= (slew_time Star6 Planet10) 15.41)
	(= (slew_time Planet10 Planet7) 18.29)
	(= (slew_time Planet7 Planet10) 18.29)
	(= (slew_time Planet10 Star8) 24.45)
	(= (slew_time Star8 Planet10) 24.45)
	(= (slew_time Planet10 Star9) 6.647)
	(= (slew_time Star9 Planet10) 6.647)
	(= (slew_time Star11 GroundStation0) 63.58)
	(= (slew_time GroundStation0 Star11) 63.58)
	(= (slew_time Star11 Star1) 21.66)
	(= (slew_time Star1 Star11) 21.66)
	(= (slew_time Star11 GroundStation2) 86.73)
	(= (slew_time GroundStation2 Star11) 86.73)
	(= (slew_time Star11 Star3) 20.85)
	(= (slew_time Star3 Star11) 20.85)
	(= (slew_time Star11 Phenomenon4) 31.79)
	(= (slew_time Phenomenon4 Star11) 31.79)
	(= (slew_time Star11 Phenomenon5) 72.33)
	(= (slew_time Phenomenon5 Star11) 72.33)
	(= (slew_time Star11 Star6) 44.12)
	(= (slew_time Star6 Star11) 44.12)
	(= (slew_time Star11 Planet7) 52.92)
	(= (slew_time Planet7 Star11) 52.92)
	(= (slew_time Star11 Star8) 84.9)
	(= (slew_time Star8 Star11) 84.9)
	(= (slew_time Star11 Star9) 12.08)
	(= (slew_time Star9 Star11) 12.08)
	(= (slew_time Star11 Planet10) 85.01)
	(= (slew_time Planet10 Star11) 85.01)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 Star6)
	(have_image Phenomenon4 image1)
	(have_image Phenomenon5 image1)
	(have_image Star6 image1)
	(have_image Planet7 image0)
	(have_image Star8 image1)
	(have_image Star9 image0)
	(have_image Planet10 image1)
	(have_image Star11 image0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 star8 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star8)
   changed: (fuel satellite1) from 176 to 91.1, (fuel-used) from 0 to 84.9
   goals met: 0 of 9
2. (turn_to satellite1 planet10 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet10)
   changed: (fuel satellite1) from 91.1 to 66.65, (fuel-used) from 84.9 to 109.35
   goals met: 0 of 9
3. (turn_to satellite0 phenomenon4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 189 to 173.26, (fuel-used) from 109.35 to 125.09
   goals met: 0 of 9
4. (turn_to satellite1 groundstation0 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 66.65 to 59.896, (fuel-used) from 125.09 to 131.844
   goals met: 0 of 9
5. (turn_to satellite1 star6 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 59.896 to 58.9447, (fuel-used) from 131.844 to 132.795
   goals met: 1 of 9
6. (turn_to satellite1 groundstation0 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 58.9447 to 57.9934, (fuel-used) from 132.795 to 133.747
   goals met: 0 of 9
7. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
8. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 0 of 9
9. (turn_to satellite1 star6 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 57.9934 to 57.0421, (fuel-used) from 133.747 to 134.698
   goals met: 1 of 9
10. (take_image satellite1 star6 instrument3 image1)
   added: (have_image star6 image1)
   changed: (data_capacity satellite1) from 1000 to 990, (data-stored) from 0 to 10
   goals met: 2 of 9
11. (turn_to satellite1 groundstation0 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 57.0421 to 56.0908, (fuel-used) from 134.698 to 135.649
   goals met: 1 of 9
12. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 56.0908 to 55.3858, (fuel-used) from 135.649 to 136.354
   goals met: 1 of 9
13. (take_image satellite1 planet7 instrument3 image0)
   added: (have_image planet7 image0)
   changed: (data_capacity satellite1) from 990 to 962, (data-stored) from 10 to 38
   goals met: 2 of 9
14. (turn_to satellite1 groundstation0 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 55.3858 to 54.6808, (fuel-used) from 136.354 to 137.059
   goals met: 2 of 9
15. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 54.6808 to 53.9758, (fuel-used) from 137.059 to 137.764
   goals met: 2 of 9
16. (turn_to satellite1 groundstation0 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 53.9758 to 53.2708, (fuel-used) from 137.764 to 138.469
   goals met: 2 of 9
17. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 53.2708 to 52.5658, (fuel-used) from 138.469 to 139.174
   goals met: 2 of 9
18. (turn_to satellite1 groundstation0 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 52.5658 to 51.8608, (fuel-used) from 139.174 to 139.879
   goals met: 2 of 9
19. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 51.8608 to 51.1558, (fuel-used) from 139.879 to 140.584
   goals met: 2 of 9
20. (turn_to satellite1 groundstation0 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 51.1558 to 50.4508, (fuel-used) from 140.584 to 141.289
   goals met: 2 of 9
21. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 50.4508 to 49.7458, (fuel-used) from 141.289 to 141.994
   goals met: 2 of 9
22. (turn_to satellite1 groundstation0 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 49.7458 to 49.0408, (fuel-used) from 141.994 to 142.699
   goals met: 2 of 9
23. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 49.0408 to 48.3358, (fuel-used) from 142.699 to 143.404
   goals met: 2 of 9
24. (turn_to satellite1 groundstation0 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 48.3358 to 47.6308, (fuel-used) from 143.404 to 144.109
   goals met: 2 of 9
25. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 47.6308 to 46.9258, (fuel-used) from 144.109 to 144.814
   goals met: 2 of 9
26. (turn_to satellite1 groundstation0 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 46.9258 to 46.2208, (fuel-used) from 144.814 to 145.519
   goals met: 2 of 9
27. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 46.2208 to 45.5158, (fuel-used) from 145.519 to 146.224
   goals met: 2 of 9
28. (turn_to satellite1 groundstation0 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 45.5158 to 44.8108, (fuel-used) from 146.224 to 146.929
   goals met: 2 of 9
29. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 44.8108 to 44.1058, (fuel-used) from 146.929 to 147.634
   goals met: 2 of 9
30. (turn_to satellite1 groundstation0 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 44.1058 to 43.4008, (fuel-used) from 147.634 to 148.339
   goals met: 2 of 9
31. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 43.4008 to 42.6958, (fuel-used) from 148.339 to 149.044
   goals met: 2 of 9
32. (turn_to satellite1 groundstation0 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 42.6958 to 41.9908, (fuel-used) from 149.044 to 149.749
   goals met: 2 of 9
33. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 41.9908 to 41.2858, (fuel-used) from 149.749 to 150.454
   goals met: 2 of 9
34. (turn_to satellite1 groundstation0 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 41.2858 to 40.5808, (fuel-used) from 150.454 to 151.159
   goals met: 2 of 9
35. (turn_to satellite1 planet7 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 40.5808 to 39.8758, (fuel-used) from 151.159 to 151.864
   goals met: 2 of 9
36. (turn_to satellite1 groundstation0 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 39.8758 to 39.1708, (fuel-used) from 151.864 to 152.569
   goals met: 2 of 9
37. (turn_to satellite1 planet10 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet10)
   changed: (fuel satellite1) from 39.1708 to 32.4168, (fuel-used) from 152.569 to 159.323
   goals met: 2 of 9
38. (take_image satellite1 planet10 instrument3 image1)
   added: (have_image planet10 image1)
   changed: (data_capacity satellite1) from 962 to 801, (data-stored) from 38 to 199
   goals met: 3 of 9
39. (turn_to satellite1 groundstation0 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 32.4168 to 25.6628, (fuel-used) from 159.323 to 166.077
   goals met: 3 of 9
40. (turn_to satellite1 star6 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 25.6628 to 24.7115, (fuel-used) from 166.077 to 167.029
   goals met: 4 of 9
41. (turn_to satellite1 star8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star8)
   changed: (fuel satellite1) from 24.7115 to 19.8735, (fuel-used) from 167.029 to 171.867
   goals met: 3 of 9
42. (take_image satellite1 star8 instrument3 image1)
   added: (have_image star8 image1)
   changed: (data_capacity satellite1) from 801 to 657, (data-stored) from 199 to 343
   goals met: 4 of 9
43. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 9
44. (turn_to satellite0 star1 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 173.26 to 157.52, (fuel-used) from 171.867 to 187.607
   goals met: 4 of 9
45. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 4 of 9
46. (turn_to satellite0 phenomenon4 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 157.52 to 141.78, (fuel-used) from 187.607 to 203.347
   goals met: 4 of 9
47. (take_image satellite0 phenomenon4 instrument1 image1)
   added: (have_image phenomenon4 image1)
   changed: (data_capacity satellite0) from 1000 to 988, (data-stored) from 343 to 355
   goals met: 5 of 9
48. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   changed: (fuel satellite1) from 19.8735 to 12.6865, (fuel-used) from 203.347 to 210.534
   goals met: 5 of 9
49. (turn_to satellite0 groundstation0 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 141.78 to 114.19, (fuel-used) from 210.534 to 238.124
   goals met: 5 of 9
50. (take_image satellite1 star9 instrument3 image0)
   added: (have_image star9 image0)
   changed: (data_capacity satellite1) from 657 to 612, (data-stored) from 355 to 400
   goals met: 6 of 9
51. (turn_to satellite1 star8 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star8)
   changed: (fuel satellite1) from 12.6865 to 5.4995, (fuel-used) from 238.124 to 245.311
   goals met: 6 of 9
52. (turn_to satellite0 star6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 114.19 to 113.239, (fuel-used) from 245.311 to 246.262
   goals met: 6 of 9
53. (turn_to satellite1 star6 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 5.4995 to 0.6615, (fuel-used) from 246.262 to 251.1
   goals met: 7 of 9
54. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 7 of 9
55. (turn_to satellite0 phenomenon5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 113.239 to 49.1387, (fuel-used) from 251.1 to 315.2
   goals met: 7 of 9
56. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 7 of 9
57. (turn_to satellite0 star3 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 49.1387 to 43.2247, (fuel-used) from 315.2 to 321.114
   goals met: 7 of 9
58. (turn_to satellite0 groundstation2 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 43.2247 to 40.6017, (fuel-used) from 321.114 to 323.737
   goals met: 7 of 9
59. (turn_to satellite0 star3 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 40.6017 to 37.9787, (fuel-used) from 323.737 to 326.36
   goals met: 7 of 9
60. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 7 of 9
61. (switch_on instrument1 satellite0)
   deleted: (calibrated instrument1) (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 7 of 9
62. (turn_to satellite0 groundstation2 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 37.9787 to 35.3557, (fuel-used) from 326.36 to 328.983
   goals met: 7 of 9
63. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 7 of 9
64. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 7 of 9
65. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 7 of 9
66. (turn_to satellite0 star3 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 35.3557 to 32.7327, (fuel-used) from 328.983 to 331.606
   goals met: 7 of 9
67. (turn_to satellite0 phenomenon5 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 32.7327 to 26.8187, (fuel-used) from 331.606 to 337.52
   goals met: 7 of 9
68. (take_image satellite0 phenomenon5 instrument0 image1)
   added: (have_image phenomenon5 image1)
   changed: (data_capacity satellite0) from 988 to 869, (data-stored) from 400 to 519
   goals met: 8 of 9
69. (turn_to satellite0 star3 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 26.8187 to 20.9047, (fuel-used) from 337.52 to 343.434
   goals met: 8 of 9
70. (turn_to satellite0 star11 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star11)
   changed: (fuel satellite0) from 20.9047 to 0.0547, (fuel-used) from 343.434 to 364.284
   goals met: 8 of 9
71. (take_image satellite0 star11 instrument0 image0)
   added: (have_image star11 image0)
   changed: (data_capacity satellite0) from 869 to 717, (data-stored) from 519 to 671
   goals met: 9 of 9
